# Practice 1: Salaries

- <font size=3>Using dataset, Salaries.csv, perform tasks and answer the following questions: </font>
    - <font size=3>Calculate the basic statistics for the <b>salary column </b></font>
    - <font size=3>Calculate the average number of phd from this dataset</font>
    - <font size=3>Find how many values in the rank column (use value_counts method)</font>
    - <font size=3>What are the mean values of the first 50 records in the dataset?   <b>Hint</b>: use loc to subset the first 50 rows and salary column then calculate the mean
    - <font size=3>Create a new column called PhD_Service to record total number of Phd students and services managed by each staff</font>
</font>

Import pandas

In [1]:
# Write your code here
import pandas as pd

Load dataset into a dataframe call salary_df

In [3]:
# Read dataset from csv file 
salary_df = pd.read_csv ('Data\salaries.csv')
salary_df.head()

   rank discipline  phd  service gender  salary
0  Prof          B   56       49   Male  186960
1  Prof          A   12        6   Male   93000
2  Prof          A   23       20   Male  110515
3  Prof          A   40       31   Male  131205
4  Prof          B   20       18   Male  104800

Calculate the basic statistics for the salary column

In [5]:
# Calculate the basic statistics for the salary column
salary_df['salary'].describe()

count        78.000000
mean     108023.782051
std       28293.661022
min       57800.000000
25%       88612.500000
50%      104671.000000
75%      126774.750000
max      186960.000000
Name: salary, dtype: float64

Calculate the average number of phd

In [6]:
# Calculate the average number of phd
salary_df['phd'].mean()

19.705128205128204

How many values in the rank column (use value_counts method)

In [7]:
# Find how many values in the rank column
salary_df['rank'].unique()

array(['Prof', 'AssocProf', 'AsstProf'], dtype=object)

What are the mean values of the first 50 records in the dataset? Hint: use loc to subset the first 50 rows and salary column then calculate the mean

In [10]:
# The mean values of the first 50 records in the dataset
df = salary_df.loc[:50,'salary']
df.mean()

113460.56862745098

Create a new column called PhD_Service to record total number of Phd students and services managed by each staff

In [11]:
# Create a new column called PhD_Service to record total number of Phd students and services managed by each staff
salary_df['PhD_Service'] = salary_df[['phd','service']].sum(axis=1)
salary_df

         rank discipline  phd  service  gender  salary  PhD_Service
0        Prof          B   56       49    Male  186960          105
1        Prof          A   12        6    Male   93000           18
2        Prof          A   23       20    Male  110515           43
3        Prof          A   40       31    Male  131205           71
4        Prof          B   20       18    Male  104800           38
..        ...        ...  ...      ...     ...     ...          ...
73       Prof          B   18       10  Female  105450           28
74  AssocProf          B   19        6  Female  104542           25
75       Prof          B   17       17  Female  124312           34
76       Prof          A   28       14  Female  109954           42
77       Prof          A   23       15  Female  109646           38

[78 rows x 7 columns]

In [13]:
# Get total sum using eval()+create new column
salary_df['new'] = salary_df.eval('phd+service')
salary_df

         rank discipline  phd  service  gender  salary  PhD_Service  new
0        Prof          B   56       49    Male  186960          105  105
1        Prof          A   12        6    Male   93000           18   18
2        Prof          A   23       20    Male  110515           43   43
3        Prof          A   40       31    Male  131205           71   71
4        Prof          B   20       18    Male  104800           38   38
..        ...        ...  ...      ...     ...     ...          ...  ...
73       Prof          B   18       10  Female  105450           28   28
74  AssocProf          B   19        6  Female  104542           25   25
75       Prof          B   17       17  Female  124312           34   34
76       Prof          A   28       14  Female  109954           42   42
77       Prof          A   23       15  Female  109646           38   38

[78 rows x 8 columns]

***